STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp255axx_ca35.h
/*
 * @brief Inter-Processor Communication Controller (IPCC)
 */
typedef struct
{
  __IO uint32_t C1CR;            /*!< IPCC Processor 1 control register                 Address offset: 0x000 */
  __IO uint32_t C1MR;            /*!< IPCC Processor 1 mask register                    Address offset: 0x004 */
  __IO uint32_t C1SCR;           /*!< IPCC Processor 1 status set clear register        Address offset: 0x008 */
  __IO uint32_t C1TOC2SR;        /*!< IPCC processor 1 to processor 2 status register   Address offset: 0x00C */
  __IO uint32_t C2CR;            /*!< IPCC Processor 2 control register                 Address offset: 0x010 */
  __IO uint32_t C2MR;            /*!< IPCC Processor 2 mask register                    Address offset: 0x014 */
  __IO uint32_t C2SCR;           /*!< IPCC Processor 2 status set clear register        Address offset: 0x018 */
  __IO uint32_t C2TOC1SR;        /*!< IPCC processor 2 to processor 1 status register   Address offset: 0x01C */
       uint32_t RESERVED0[24];   /*!< Reserved                                          Address offset: 0x020-0x07C */
  __IO uint32_t C1SECCFGR;       /*!< IPCC Processor 1 security configuration register  Address offset: 0x080 */
  __IO uint32_t C1PRIVCFGR;      /*!< IPCC processor 1 privilege configuration register Address offset: 0x084 */
  __IO uint32_t C1CIDCFGR;       /*!< IPCC processor 1 CID configuration register       Address offset: 0x088 */
       uint32_t RESERVED1;       /*!< Reserved                                          Address offset: 0x08C */
  __IO uint32_t C2SECCFGR;       /*!< IPCC processor 2 security configuration register  Address offset: 0x090 */
  __IO uint32_t C2PRIVCFGR;      /*!< IPCC processor 2 privilege configuration register Address offset: 0x094 */
  __IO uint32_t C2CIDCFGR;       /*!< IPCC processor 2 CID configuration register       Address offset: 0x098 */
       uint32_t RESERVED2[213];  /*!< Reserved                                          Address offset: 0x09C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< IPCC Hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< IPCC IP Version register                          Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< IPCC IP Identification register                   Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< IPCC Size ID register                             Address offset: 0x3FC */
} IPCC_TypeDef;

typedef struct
{
  __IO uint32_t CR;              /*!< Control register                                  Address offset: 0x000 */
  __IO uint32_t MR;              /*!< Mask register                                     Address offset: 0x004 */
  __IO uint32_t SCR;             /*!< Status set clear register                         Address offset: 0x008 */
  __IO uint32_t SR;              /*!< Status register                                   Address offset: 0x00C */
} IPCC_CommonTypeDef;

/*
 * @brief Independent Watchdog (IWDG)
 */
typedef struct
{
  __IO uint32_t KR;              /*!< IWDG key register                    Address offset: 0x000 */
  __IO uint32_t PR;              /*!< IWDG prescaler register              Address offset: 0x004 */
  __IO uint32_t RLR;             /*!< IWDG reload register                 Address offset: 0x008 */
  __IO uint32_t SR;              /*!< IWDG status register                 Address offset: 0x00C */
  __IO uint32_t WINR;            /*!< IWDG window register                 Address offset: 0x010 */
  __IO uint32_t EWCR;            /*!< IWDG early wakeup interrupt register Address offset: 0x014 */
  __IO uint32_t ICR;             /*!< IWDG Interrupt clear register        Address offset: 0x018 */
       uint32_t RESERVED0[245];  /*!< Reserved                             Address offset: 0x01C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< IWDG hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< IWDG version register                Address offset: 0x3F4 */
  __IO uint32_t IDR;             /*!< IWDG identification register         Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< IWDG size identification register    Address offset: 0x3FC */
} IWDG_TypeDef;

/*
 * @brief Low power timer (LPTIM)
          IP version is v2_1
 */
typedef struct
{
  __IO uint32_t ISR;             /*!< LPTIM interrupt and status register                 Address offset: 0x000 */
  __IO uint32_t ICR;             /*!< LPTIM interrupt clear register                      Address offset: 0x004 */
  __IO uint32_t DIER;            /*!< LPTIM interrupt enable register                     Address offset: 0x008 */
  __IO uint32_t CFGR;            /*!< LPTIM configuration register                        Address offset: 0x00C */
  __IO uint32_t CR;              /*!< LPTIM control register                              Address offset: 0x010 */
  __IO uint32_t CCR1;            /*!< LPTIM compare register 1                            Address offset: 0x014 */
  __IO uint32_t ARR;             /*!< LPTIM autoreload register                           Address offset: 0x018 */
  __IO uint32_t CNT;             /*!< LPTIM counter register                              Address offset: 0x01C */
  __IO uint32_t OR;              /*!< LPTIM1 option register                              Address offset: 0x020 */
  __IO uint32_t CFGR2;           /*!< LPTIM configuration register 2                      Address offset: 0x024 */
  __IO uint32_t RCR;             /*!< LPTIM repetition register                           Address offset: 0x028 */
  __IO uint32_t CCMR1;           /*!< LPTIM capture/compare mode register 1               Address offset: 0x02C */
       uint32_t RESERVED1;       /*!< Reserved                                            Address offset: 0x030 */
  __IO uint32_t CCR2;            /*!< LPTIM compare register 2                            Address offset: 0x034 */
       uint32_t RESERVED2[237];  /*!< Reserved                                            Address offset: 0x038-0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< LPTIM peripheral hardware configuration register 2  Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< LPTIM peripheral hardware configuration register 1  Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< LPTIM peripheral version identification register    Address offset: 0x3F4 */
  __IO uint32_t PIDR;            /*!< LPTIM peripheral type identification register       Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< LPTIM registers map size identification register    Address offset: 0x3FC */
} LPTIM_TypeDef;

/**
  * @brief LCD-TFT Display Controller
  */

typedef struct
{
  __IO uint32_t IDR;             /*!< LTDC identification register                                  Address offset: 0x0000 */
  __IO uint32_t LCR;             /*!< LDTC layer count register                                     Address offset: 0x0004 */
  __IO uint32_t SSCR;            /*!< LTDC synchronization size configuration register              Address offset: 0x0008 */
  __IO uint32_t BPCR;            /*!< LTDC back porch configuration register                        Address offset: 0x000C */
  __IO uint32_t AWCR;            /*!< LTDC active width configuration register                      Address offset: 0x0010 */
  __IO uint32_t TWCR;            /*!< LTDC total width configuration register                       Address offset: 0x0014 */
  __IO uint32_t GCR;             /*!< LTDC global control register                                  Address offset: 0x0018 */
  __IO uint32_t GC1R;            /*!< LTDC global configuration 1 register                          Address offset: 0x001C */
  __IO uint32_t GC2R;            /*!< LTDC global configuration 2 register                          Address offset: 0x0020 */
  __IO uint32_t SRCR;            /*!< LTDC shadow reload configuration register                     Address offset: 0x0024 */
  __IO uint32_t GCCR;            /*!< LTDC gamma correction configuration register                  Address offset: 0x0028 */
  __IO uint32_t BCCR;            /*!< LTDC background color configuration register                  Address offset: 0x002C */
       uint32_t RESERVED0;       /*!< Reserved                                                      Address offset: 0x0030 */
  __IO uint32_t IER;             /*!< LTDC interrupt enable register                                Address offset: 0x0034 */
  __IO uint32_t ISR;             /*!< LTDC interrupt status register                                Address offset: 0x0038 */
  __IO uint32_t ICR;             /*!< LTDC interrupt clear register                                 Address offset: 0x003C */
  __IO uint32_t LIPCR;           /*!< LTDC line interrupt position configuration register           Address offset: 0x0040 */
  __IO uint32_t CPSR;            /*!< LTDC current position status register                         Address offset: 0x0044 */
  __IO uint32_t CDSR;            /*!< LTDC current display status register                          Address offset: 0x0048 */
       uint32_t RESERVED1[5];    /*!< Reserved                                                      Address offset: 0x004C-0x005C */
  __IO uint32_t EDCR;            /*!< LTDC external display control register                        Address offset: 0x0060 */
  __IO uint32_t IER2;            /*!< LTDC interrupt enable register 2                              Address offset: 0x0064 */
  __IO uint32_t ISR2;            /*!< LTDC interrupt status register 2                              Address offset: 0x0068 */
  __IO uint32_t ICR2;            /*!< LTDC interrupt clear register 2                               Address offset: 0x006C */
  __IO uint32_t LIPCR2;          /*!< LTDC line interrupt position configuration register 2         Address offset: 0x0070 */
       uint32_t RESERVED2;       /*!< Reserved                                                      Address offset: 0x0074 */
  __IO uint32_t ECRCR;           /*!< LTDC expected CRC register                                    Address offset: 0x0078 */
  __IO uint32_t CCRCR;           /*!< LTDC computed CRC register                                    Address offset: 0x007C */
  __IO uint32_t RB0AR;           /*!< LTDC rotation buffer 0 address register                       Address offset: 0x0080 */
  __IO uint32_t RB1AR;           /*!< LTDC rotation buffer 1 address register                       Address offset: 0x0084 */
  __IO uint32_t RBPR;            /*!< LTDC rotation buffer pitch register                           Address offset: 0x0088 */
  __IO uint32_t RIFCR;           /*!< LTDC rotation intermediate frame color register               Address offset: 0x008C */
  __IO uint32_t FUTR;            /*!< LTDC FIFO underrun threshold register                         Address offset: 0x0090 */
} LTDC_TypeDef;

/**
  * @brief LCD-TFT Display layer x Controller
  */

typedef struct
{
  __IO uint32_t C0R;             /*!< LTDC layerx configuration 0 register                          Address offset: 0x0100 */
  __IO uint32_t C1R;             /*!< LTDC layerx configuration 1 register                          Address offset: 0x0104 */
  __IO uint32_t RCR;             /*!< LTDC layerx reload control register                           Address offset: 0x0108 */
  __IO uint32_t CR;              /*!< LTDC layerx control register                                  Address offset: 0x010C */
  __IO uint32_t WHPCR;           /*!< LTDC layerx window horizontal position configuration register Address offset: 0x0110 */
  __IO uint32_t WVPCR;           /*!< LTDC layerx window vertical position configuration register   Address offset: 0x0114 */
  __IO uint32_t CKCR;            /*!< LTDC layerx color keying configuration register               Address offset: 0x0118 */
  __IO uint32_t PFCR;            /*!< LTDC layerx pixel format configuration register               Address offset: 0x011C */
  __IO uint32_t CACR;            /*!< LTDC layerx constant alpha configuration register             Address offset: 0x0120 */
  __IO uint32_t DCCR;            /*!< LTDC layerx default color configuration register              Address offset: 0x0124 */
  __IO uint32_t BFCR;            /*!< LTDC layerx blending factors configuration register           Address offset: 0x0128 */
  __IO uint32_t BLCR;            /*!< LTDC layerx burst length configuration register               Address offset: 0x012C */
  __IO uint32_t PCR;             /*!< LTDC layerx planar configuration register                     Address offset: 0x0130 */
  __IO uint32_t CFBAR;           /*!< LTDC layerx color frame buffer address register               Address offset: 0x0134 */
  __IO uint32_t CFBLR;           /*!< LTDC layerx color frame buffer length register                Address offset: 0x0138 */
  __IO uint32_t CFBLNR;          /*!< LTDC layerx color frame buffer line number register           Address offset: 0x013C */
  __IO uint32_t AFBA0R;          /*!< LTDC layerx auxiliary frame buffer address 0 register         Address offset: 0x0140 */
  __IO uint32_t AFBA1R;          /*!< LTDC layerx auxiliary frame buffer address 1 register         Address offset: 0x0144 */
  __IO uint32_t AFBLR;           /*!< LTDC layerx auxiliary frame buffer length register            Address offset: 0x0148 */
  __IO uint32_t AFBLNR;          /*!< LTDC layerx auxiliary frame buffer line number register       Address offset: 0x014C */
  __IO uint32_t CLUTWR;          /*!< LTDC layerx CLUT write register                               Address offset: 0x0150 */
  __IO uint32_t SISR;            /*!< LTDC layerx scaler input size register                        Address offset: 0x0154 */
  __IO uint32_t SOSR;            /*!< LTDC layerx scaler output size register                       Address offset: 0x0158 */
  __IO uint32_t SVSFR;           /*!< LTDC layerx scaler vertical scaling factor register           Address offset: 0x015C */
  __IO uint32_t SVSPR;           /*!< LTDC layerx scaler vertical scaling phase register            Address offset: 0x0160 */
  __IO uint32_t SHSFR;           /*!< LTDC layerx scaler horizontal scaling factor register         Address offset: 0x0164 */
  __IO uint32_t SHSPR;           /*!< LTDC layerx scaler horizontal scaling phase register          Address offset: 0x0168 */
  __IO uint32_t CYR0R;           /*!< LTDC layerx conversion YCbCr RGB 0 register                   Address offset: 0x016C */
  __IO uint32_t CYR1R;           /*!< LTDC layerx conversion YCbCr RGB 1 register                   Address offset: 0x0170 */
  __IO uint32_t FPF0R;           /*!< LTDC layerx flexible pixel format 0 register                  Address offset: 0x0174 */
  __IO uint32_t FPF1R;           /*!< LTDC layerx flexible pixel format 1 register                  Address offset: 0x0178 */
} LTDC_Layer_TypeDef;

